Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dfsdm.h
/*
 * SPDX-License-Identifier: MIT
 * SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
 *
 * Generated using the .svd description
 * Goal:     stm32H747_CM4_dfsdm equates.
 */

#pragma once

#include    <stdint.h>

// DFSDM address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    CH0CFGR1;
    volatile    uint32_t    CH0CFGR2;
    volatile    uint32_t    CH0AWSCDR;
    volatile    uint32_t    CH0WDATR;
    volatile    uint32_t    CH0DATINR;
    volatile    uint32_t    CH0DLYR;
    volatile    uint32_t    RESERVED0[2];
    volatile    uint32_t    CH1CFGR1;
    volatile    uint32_t    CH1CFGR2;
    volatile    uint32_t    CH1AWSCDR;
    volatile    uint32_t    CH1WDATR;
    volatile    uint32_t    CH1DATINR;
    volatile    uint32_t    CH1DLYR;
    volatile    uint32_t    RESERVED1[2];
    volatile    uint32_t    CH2CFGR1;
    volatile    uint32_t    CH2CFGR2;
    volatile    uint32_t    CH2AWSCDR;
    volatile    uint32_t    CH2WDATR;
    volatile    uint32_t    CH2DATINR;
    volatile    uint32_t    CH2DLYR;
    volatile    uint32_t    RESERVED2[2];
    volatile    uint32_t    CH3CFGR1;
    volatile    uint32_t    CH3CFGR2;
    volatile    uint32_t    CH3AWSCDR;
    volatile    uint32_t    CH3WDATR;
    volatile    uint32_t    CH3DATINR;
    volatile    uint32_t    CH3DLYR;
    volatile    uint32_t    RESERVED3[2];
    volatile    uint32_t    CH4CFGR1;
    volatile    uint32_t    CH4CFGR2;
    volatile    uint32_t    CH4AWSCDR;
    volatile    uint32_t    CH4WDATR;
    volatile    uint32_t    CH4DATINR;
    volatile    uint32_t    CH4DLYR;
    volatile    uint32_t    RESERVED4[2];
    volatile    uint32_t    CH5CFGR1;
    volatile    uint32_t    CH5CFGR2;
    volatile    uint32_t    CH5AWSCDR;
    volatile    uint32_t    CH5WDATR;
    volatile    uint32_t    CH5DATINR;
    volatile    uint32_t    CH5DLYR;
    volatile    uint32_t    RESERVED5[2];
    volatile    uint32_t    CH6CFGR1;
    volatile    uint32_t    CH6CFGR2;
    volatile    uint32_t    CH6AWSCDR;
    volatile    uint32_t    CH6WDATR;
    volatile    uint32_t    CH6DATINR;
    volatile    uint32_t    CH6DLYR;
    volatile    uint32_t    RESERVED6[2];
    volatile    uint32_t    CH7CFGR1;
    volatile    uint32_t    CH7CFGR2;
    volatile    uint32_t    CH7AWSCDR;
    volatile    uint32_t    CH7WDATR;
    volatile    uint32_t    CH7DATINR;
    volatile    uint32_t    CH7DLYR;
    volatile    uint32_t    RESERVED7[2];
    volatile    uint32_t    FLT0CR1;
    volatile    uint32_t    FLT0CR2;
    volatile    uint32_t    FLT0ISR;
    volatile    uint32_t    FLT0ICR;
    volatile    uint32_t    FLT0JCHGR;
    volatile    uint32_t    FLT0FCR;
    volatile    uint32_t    FLT0JDATAR;
    volatile    uint32_t    FLT0RDATAR;
    volatile    uint32_t    FLT0AWHTR;
    volatile    uint32_t    FLT0AWLTR;
    volatile    uint32_t    FLT0AWSR;
    volatile    uint32_t    FLT0AWCFR;
    volatile    uint32_t    FLT0EXMAX;
    volatile    uint32_t    FLT0EXMIN;
    volatile    uint32_t    FLT0CNVTIMR;
    volatile    uint32_t    RESERVED8[17];
    volatile    uint32_t    FLT1CR1;
    volatile    uint32_t    FLT1CR2;
    volatile    uint32_t    FLT1ISR;
    volatile    uint32_t    FLT1ICR;
    volatile    uint32_t    FLT1CHGR;
    volatile    uint32_t    FLT1FCR;
    volatile    uint32_t    FLT1JDATAR;
    volatile    uint32_t    FLT1RDATAR;
    volatile    uint32_t    FLT1AWHTR;
    volatile    uint32_t    FLT1AWLTR;
    volatile    uint32_t    FLT1AWSR;
    volatile    uint32_t    FLT1AWCFR;
    volatile    uint32_t    FLT1EXMAX;
    volatile    uint32_t    FLT1EXMIN;
    volatile    uint32_t    FLT1CNVTIMR;
    volatile    uint32_t    RESERVED9[17];
    volatile    uint32_t    FLT2CR1;
    volatile    uint32_t    FLT2CR2;
    volatile    uint32_t    FLT2ISR;
    volatile    uint32_t    FLT2ICR;
    volatile    uint32_t    FLT2JCHGR;
    volatile    uint32_t    FLT2FCR;
    volatile    uint32_t    FLT2JDATAR;
    volatile    uint32_t    FLT2RDATAR;
    volatile    uint32_t    FLT2AWHTR;
    volatile    uint32_t    FLT2AWLTR;
    volatile    uint32_t    FLT2AWSR;
    volatile    uint32_t    FLT2AWCFR;
    volatile    uint32_t    FLT2EXMAX;
    volatile    uint32_t    FLT2EXMIN;
    volatile    uint32_t    FLT2CNVTIMR;
    volatile    uint32_t    RESERVED10[17];
    volatile    uint32_t    FLT3CR1;
    volatile    uint32_t    FLT3CR2;
    volatile    uint32_t    FLT3ISR;
    volatile    uint32_t    FLT3ICR;
    volatile    uint32_t    FLT3JCHGR;
    volatile    uint32_t    FLT3FCR;
    volatile    uint32_t    FLT3JDATAR;
    volatile    uint32_t    FLT3RDATAR;
    volatile    uint32_t    FLT3AWHTR;
    volatile    uint32_t    FLT3AWLTR;
    volatile    uint32_t    FLT3AWSR;
    volatile    uint32_t    FLT3AWCFR;
    volatile    uint32_t    FLT3EXMAX;
    volatile    uint32_t    FLT3EXMIN;
    volatile    uint32_t    FLT3CNVTIMR;
} DFSDM_TypeDef;

#ifdef __cplusplus
#define DFSDM   reinterpret_cast<DFSDM_TypeDef *>(0x40017000U)

#else
#define DFSDM   ((DFSDM_TypeDef *)0x40017000U)
#endif

// CH0CFGR1 Configuration

#define DFSDM_CH0CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH0CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH0CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH0CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH0CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH0CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH0CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH0CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH0CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH0CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH0CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH0CFGR1_DATPACK_0    (0x1U<<14U)
#define DFSDM_CH0CFGR1_CKOUTDIV     (0xFFU<<16U)
#define DFSDM_CH0CFGR1_CKOUTDIV_0   (0x1U<<16U)
#define DFSDM_CH0CFGR1_CKOUTSRC     (0x1U<<30U)
#define DFSDM_CH0CFGR1_DFSDMEN      (0x1U<<31U)

// CH0CFGR2 Configuration

#define DFSDM_CH0CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH0CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH0CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH0CFGR2_OFFSET_0     (0x1U<<8U)

// CH0AWSCDR Configuration

#define DFSDM_CH0AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH0AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH0AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH0AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH0AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH0AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH0AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH0AWSCDR_AWFORD_0    (0x1U<<22U)

// CH0WDATR Configuration

