Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dfsdm.h
#define DFSDM_CH0WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH0WDATR_WDATA_0      (0x1U<<0U)

// CH0DATINR Configuration

#define DFSDM_CH0DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH0DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH0DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH0DATINR_INDAT1_0    (0x1U<<16U)

// CH0DLYR Configuration

#define DFSDM_CH0DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH0DLYR_PLSSKP_0      (0x1U<<0U)

// CH1CFGR1 Configuration

#define DFSDM_CH1CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH1CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH1CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH1CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH1CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH1CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH1CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH1CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH1CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH1CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH1CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH1CFGR1_DATPACK_0    (0x1U<<14U)

// CH1CFGR2 Configuration

#define DFSDM_CH1CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH1CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH1CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH1CFGR2_OFFSET_0     (0x1U<<8U)

// CH1AWSCDR Configuration

#define DFSDM_CH1AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH1AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH1AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH1AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH1AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH1AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH1AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH1AWSCDR_AWFORD_0    (0x1U<<22U)

// CH1WDATR Configuration

#define DFSDM_CH1WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH1WDATR_WDATA_0      (0x1U<<0U)

// CH1DATINR Configuration

#define DFSDM_CH1DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH1DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH1DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH1DATINR_INDAT1_0    (0x1U<<16U)

// CH1DLYR Configuration

#define DFSDM_CH1DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH1DLYR_PLSSKP_0      (0x1U<<0U)

// CH2CFGR1 Configuration

#define DFSDM_CH2CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH2CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH2CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH2CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH2CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH2CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH2CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH2CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH2CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH2CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH2CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH2CFGR1_DATPACK_0    (0x1U<<14U)

// CH2CFGR2 Configuration

#define DFSDM_CH2CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH2CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH2CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH2CFGR2_OFFSET_0     (0x1U<<8U)

// CH2AWSCDR Configuration

#define DFSDM_CH2AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH2AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH2AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH2AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH2AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH2AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH2AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH2AWSCDR_AWFORD_0    (0x1U<<22U)

// CH2WDATR Configuration

#define DFSDM_CH2WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH2WDATR_WDATA_0      (0x1U<<0U)

// CH2DATINR Configuration

#define DFSDM_CH2DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH2DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH2DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH2DATINR_INDAT1_0    (0x1U<<16U)

// CH2DLYR Configuration

#define DFSDM_CH2DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH2DLYR_PLSSKP_0      (0x1U<<0U)

// CH3CFGR1 Configuration

#define DFSDM_CH3CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH3CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH3CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH3CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH3CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH3CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH3CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH3CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH3CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH3CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH3CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH3CFGR1_DATPACK_0    (0x1U<<14U)

// CH3CFGR2 Configuration

#define DFSDM_CH3CFGR2_DTRBS        (0x1FU<<3U)
#define DFSDM_CH3CFGR2_DTRBS_0      (0x1U<<3U)
#define DFSDM_CH3CFGR2_OFFSET       (0xFFFFFFU<<8U)
#define DFSDM_CH3CFGR2_OFFSET_0     (0x1U<<8U)

// CH3AWSCDR Configuration

#define DFSDM_CH3AWSCDR_SCDT        (0xFFU<<0U)
#define DFSDM_CH3AWSCDR_SCDT_0      (0x1U<<0U)
#define DFSDM_CH3AWSCDR_BKSCD       (0xFU<<12U)
#define DFSDM_CH3AWSCDR_BKSCD_0     (0x1U<<12U)
#define DFSDM_CH3AWSCDR_AWFOSR      (0x1FU<<16U)
#define DFSDM_CH3AWSCDR_AWFOSR_0    (0x1U<<16U)
#define DFSDM_CH3AWSCDR_AWFORD      (0x3U<<22U)
#define DFSDM_CH3AWSCDR_AWFORD_0    (0x1U<<22U)

// CH3WDATR Configuration

#define DFSDM_CH3WDATR_WDATA        (0xFFFFU<<0U)
#define DFSDM_CH3WDATR_WDATA_0      (0x1U<<0U)

// CH3DATINR Configuration

#define DFSDM_CH3DATINR_INDAT0      (0xFFFFU<<0U)
#define DFSDM_CH3DATINR_INDAT0_0    (0x1U<<0U)
#define DFSDM_CH3DATINR_INDAT1      (0xFFFFU<<16U)
#define DFSDM_CH3DATINR_INDAT1_0    (0x1U<<16U)

// CH3DLYR Configuration

#define DFSDM_CH3DLYR_PLSSKP        (0x3FU<<0U)
#define DFSDM_CH3DLYR_PLSSKP_0      (0x1U<<0U)

// CH4CFGR1 Configuration

#define DFSDM_CH4CFGR1_SITP         (0x3U<<0U)
#define DFSDM_CH4CFGR1_SITP_0       (0x1U<<0U)
#define DFSDM_CH4CFGR1_SPICKSEL     (0x3U<<2U)
#define DFSDM_CH4CFGR1_SPICKSEL_0   (0x1U<<2U)
#define DFSDM_CH4CFGR1_SCDEN        (0x1U<<5U)
#define DFSDM_CH4CFGR1_CKABEN       (0x1U<<6U)
#define DFSDM_CH4CFGR1_CHEN         (0x1U<<7U)
#define DFSDM_CH4CFGR1_CHINSEL      (0x1U<<8U)
#define DFSDM_CH4CFGR1_DATMPX       (0x3U<<12U)
#define DFSDM_CH4CFGR1_DATMPX_0     (0x1U<<12U)
#define DFSDM_CH4CFGR1_DATPACK      (0x3U<<14U)
#define DFSDM_CH4CFGR1_DATPACK_0    (0x1U<<14U)

