Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dfsdm.h
// FLT0CR1 Configuration

#define DFSDM_FLT0CR1_DFEN          (0x1U<<0U)
#define DFSDM_FLT0CR1_JSWSTART      (0x1U<<1U)
#define DFSDM_FLT0CR1_JSYNC         (0x1U<<3U)
#define DFSDM_FLT0CR1_JSCAN         (0x1U<<4U)
#define DFSDM_FLT0CR1_JDMAEN        (0x1U<<5U)
#define DFSDM_FLT0CR1_JEXTSEL       (0x7U<<8U)
#define DFSDM_FLT0CR1_JEXTSEL_0     (0x1U<<8U)
#define DFSDM_FLT0CR1_JEXTEN        (0x3U<<13U)
#define DFSDM_FLT0CR1_JEXTEN_0      (0x1U<<13U)
#define DFSDM_FLT0CR1_RSWSTART      (0x1U<<17U)
#define DFSDM_FLT0CR1_RCONT         (0x1U<<18U)
#define DFSDM_FLT0CR1_RSYNC         (0x1U<<19U)
#define DFSDM_FLT0CR1_RDMAEN        (0x1U<<21U)
#define DFSDM_FLT0CR1_RCH           (0x7U<<24U)
#define DFSDM_FLT0CR1_RCH_0         (0x1U<<24U)
#define DFSDM_FLT0CR1_FAST          (0x1U<<29U)
#define DFSDM_FLT0CR1_AWFSEL        (0x1U<<30U)

// FLT0CR2 Configuration

#define DFSDM_FLT0CR2_JEOCIE        (0x1U<<0U)
#define DFSDM_FLT0CR2_REOCIE        (0x1U<<1U)
#define DFSDM_FLT0CR2_JOVRIE        (0x1U<<2U)
#define DFSDM_FLT0CR2_ROVRIE        (0x1U<<3U)
#define DFSDM_FLT0CR2_AWDIE         (0x1U<<4U)
#define DFSDM_FLT0CR2_SCDIE         (0x1U<<5U)
#define DFSDM_FLT0CR2_CKABIE        (0x1U<<6U)
#define DFSDM_FLT0CR2_EXCH          (0xFFU<<8U)
#define DFSDM_FLT0CR2_EXCH_0        (0x1U<<8U)
#define DFSDM_FLT0CR2_AWDCH         (0xFFU<<16U)
#define DFSDM_FLT0CR2_AWDCH_0       (0x1U<<16U)

// FLT0ISR Configuration

#define DFSDM_FLT0ISR_JEOCF         (0x1U<<0U)
#define DFSDM_FLT0ISR_REOCF         (0x1U<<1U)
#define DFSDM_FLT0ISR_JOVRF         (0x1U<<2U)
#define DFSDM_FLT0ISR_ROVRF         (0x1U<<3U)
#define DFSDM_FLT0ISR_AWDF          (0x1U<<4U)
#define DFSDM_FLT0ISR_JCIP          (0x1U<<13U)
#define DFSDM_FLT0ISR_RCIP          (0x1U<<14U)
#define DFSDM_FLT0ISR_CKABF         (0xFFU<<16U)
#define DFSDM_FLT0ISR_CKABF_0       (0x1U<<16U)
#define DFSDM_FLT0ISR_SCDF          (0xFFU<<24U)
#define DFSDM_FLT0ISR_SCDF_0        (0x1U<<24U)

// FLT0ICR Configuration

#define DFSDM_FLT0ICR_CLRJOVRF      (0x1U<<2U)
#define DFSDM_FLT0ICR_CLRROVRF      (0x1U<<3U)
#define DFSDM_FLT0ICR_CLRCKABF      (0xFFU<<16U)
#define DFSDM_FLT0ICR_CLRCKABF_0    (0x1U<<16U)
#define DFSDM_FLT0ICR_CLRSCDF       (0xFFU<<24U)
#define DFSDM_FLT0ICR_CLRSCDF_0     (0x1U<<24U)

// FLT0JCHGR Configuration

#define DFSDM_FLT0JCHGR_JCHG        (0xFFU<<0U)
#define DFSDM_FLT0JCHGR_JCHG_0      (0x1U<<0U)

// FLT0FCR Configuration

#define DFSDM_FLT0FCR_IOSR          (0xFFU<<0U)
#define DFSDM_FLT0FCR_IOSR_0        (0x1U<<0U)
#define DFSDM_FLT0FCR_FOSR          (0x3FFU<<16U)
#define DFSDM_FLT0FCR_FOSR_0        (0x1U<<16U)
#define DFSDM_FLT0FCR_FORD          (0x7U<<29U)
#define DFSDM_FLT0FCR_FORD_0        (0x1U<<29U)

// FLT0JDATAR Configuration

#define DFSDM_FLT0JDATAR_JDATACH    (0x7U<<0U)
#define DFSDM_FLT0JDATAR_JDATACH_0  (0x1U<<0U)
#define DFSDM_FLT0JDATAR_JDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT0JDATAR_JDATA_0    (0x1U<<8U)

// FLT0RDATAR Configuration

#define DFSDM_FLT0RDATAR_RDATACH    (0x7U<<0U)
#define DFSDM_FLT0RDATAR_RDATACH_0  (0x1U<<0U)
#define DFSDM_FLT0RDATAR_RPEND      (0x1U<<4U)
#define DFSDM_FLT0RDATAR_RDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT0RDATAR_RDATA_0    (0x1U<<8U)

// FLT0AWHTR Configuration

#define DFSDM_FLT0AWHTR_BKAWH       (0xFU<<0U)
#define DFSDM_FLT0AWHTR_BKAWH_0     (0x1U<<0U)
#define DFSDM_FLT0AWHTR_AWHT        (0xFFFFFFU<<8U)
#define DFSDM_FLT0AWHTR_AWHT_0      (0x1U<<8U)

// FLT0AWLTR Configuration

#define DFSDM_FLT0AWLTR_BKAWL       (0xFU<<0U)
#define DFSDM_FLT0AWLTR_BKAWL_0     (0x1U<<0U)
#define DFSDM_FLT0AWLTR_AWLT        (0xFFFFFFU<<8U)
#define DFSDM_FLT0AWLTR_AWLT_0      (0x1U<<8U)

// FLT0AWSR Configuration

#define DFSDM_FLT0AWSR_AWLTF        (0xFFU<<0U)
#define DFSDM_FLT0AWSR_AWLTF_0      (0x1U<<0U)
#define DFSDM_FLT0AWSR_AWHTF        (0xFFU<<8U)
#define DFSDM_FLT0AWSR_AWHTF_0      (0x1U<<8U)

// FLT0AWCFR Configuration

#define DFSDM_FLT0AWCFR_CLRAWLTF    (0xFFU<<0U)
#define DFSDM_FLT0AWCFR_CLRAWLTF_0  (0x1U<<0U)
#define DFSDM_FLT0AWCFR_CLRAWHTF    (0xFFU<<8U)
#define DFSDM_FLT0AWCFR_CLRAWHTF_0  (0x1U<<8U)

// FLT0EXMAX Configuration

#define DFSDM_FLT0EXMAX_EXMAXCH     (0x7U<<0U)
#define DFSDM_FLT0EXMAX_EXMAXCH_0   (0x1U<<0U)
#define DFSDM_FLT0EXMAX_EXMAX       (0xFFFFFFU<<8U)
#define DFSDM_FLT0EXMAX_EXMAX_0     (0x1U<<8U)

// FLT0EXMIN Configuration

#define DFSDM_FLT0EXMIN_EXMINCH     (0x7U<<0U)
#define DFSDM_FLT0EXMIN_EXMINCH_0   (0x1U<<0U)
#define DFSDM_FLT0EXMIN_EXMIN       (0xFFFFFFU<<8U)
#define DFSDM_FLT0EXMIN_EXMIN_0     (0x1U<<8U)

// FLT0CNVTIMR Configuration

#define DFSDM_FLT0CNVTIMR_CNVCNT    (0xFFFFFFFU<<4U)
#define DFSDM_FLT0CNVTIMR_CNVCNT_0  (0x1U<<4U)

// FLT1CR1 Configuration

#define DFSDM_FLT1CR1_DFEN          (0x1U<<0U)
#define DFSDM_FLT1CR1_JSWSTART      (0x1U<<1U)
#define DFSDM_FLT1CR1_JSYNC         (0x1U<<3U)
#define DFSDM_FLT1CR1_JSCAN         (0x1U<<4U)
#define DFSDM_FLT1CR1_JDMAEN        (0x1U<<5U)
#define DFSDM_FLT1CR1_JEXTSEL       (0x7U<<8U)
#define DFSDM_FLT1CR1_JEXTSEL_0     (0x1U<<8U)
#define DFSDM_FLT1CR1_JEXTEN        (0x3U<<13U)
#define DFSDM_FLT1CR1_JEXTEN_0      (0x1U<<13U)
#define DFSDM_FLT1CR1_RSWSTART      (0x1U<<17U)
#define DFSDM_FLT1CR1_RCONT         (0x1U<<18U)
#define DFSDM_FLT1CR1_RSYNC         (0x1U<<19U)
#define DFSDM_FLT1CR1_RDMAEN        (0x1U<<21U)
#define DFSDM_FLT1CR1_RCH           (0x7U<<24U)
#define DFSDM_FLT1CR1_RCH_0         (0x1U<<24U)
#define DFSDM_FLT1CR1_FAST          (0x1U<<29U)
#define DFSDM_FLT1CR1_AWFSEL        (0x1U<<30U)

// FLT1CR2 Configuration

#define DFSDM_FLT1CR2_JEOCIE        (0x1U<<0U)
#define DFSDM_FLT1CR2_REOCIE        (0x1U<<1U)
#define DFSDM_FLT1CR2_JOVRIE        (0x1U<<2U)
#define DFSDM_FLT1CR2_ROVRIE        (0x1U<<3U)
#define DFSDM_FLT1CR2_AWDIE         (0x1U<<4U)
#define DFSDM_FLT1CR2_SCDIE         (0x1U<<5U)
#define DFSDM_FLT1CR2_CKABIE        (0x1U<<6U)
#define DFSDM_FLT1CR2_EXCH          (0xFFU<<8U)
#define DFSDM_FLT1CR2_EXCH_0        (0x1U<<8U)
#define DFSDM_FLT1CR2_AWDCH         (0xFFU<<16U)
#define DFSDM_FLT1CR2_AWDCH_0       (0x1U<<16U)

// FLT1ISR Configuration

#define DFSDM_FLT1ISR_JEOCF         (0x1U<<0U)
#define DFSDM_FLT1ISR_REOCF         (0x1U<<1U)
#define DFSDM_FLT1ISR_JOVRF         (0x1U<<2U)
#define DFSDM_FLT1ISR_ROVRF         (0x1U<<3U)
#define DFSDM_FLT1ISR_AWDF          (0x1U<<4U)
#define DFSDM_FLT1ISR_JCIP          (0x1U<<13U)
#define DFSDM_FLT1ISR_RCIP          (0x1U<<14U)
#define DFSDM_FLT1ISR_CKABF         (0xFFU<<16U)
#define DFSDM_FLT1ISR_CKABF_0       (0x1U<<16U)
#define DFSDM_FLT1ISR_SCDF          (0xFFU<<24U)
#define DFSDM_FLT1ISR_SCDF_0        (0x1U<<24U)

// FLT1ICR Configuration

#define DFSDM_FLT1ICR_CLRJOVRF      (0x1U<<2U)
#define DFSDM_FLT1ICR_CLRROVRF      (0x1U<<3U)
#define DFSDM_FLT1ICR_CLRCKABF      (0xFFU<<16U)
#define DFSDM_FLT1ICR_CLRCKABF_0    (0x1U<<16U)
#define DFSDM_FLT1ICR_CLRSCDF       (0xFFU<<24U)
#define DFSDM_FLT1ICR_CLRSCDF_0     (0x1U<<24U)

