Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32H747/Includes/Registers/stm32H747_CM4_dfsdm.h
// FLT1CHGR Configuration

#define DFSDM_FLT1CHGR_JCHG         (0xFFU<<0U)
#define DFSDM_FLT1CHGR_JCHG_0       (0x1U<<0U)

// FLT1FCR Configuration

#define DFSDM_FLT1FCR_IOSR          (0xFFU<<0U)
#define DFSDM_FLT1FCR_IOSR_0        (0x1U<<0U)
#define DFSDM_FLT1FCR_FOSR          (0x3FFU<<16U)
#define DFSDM_FLT1FCR_FOSR_0        (0x1U<<16U)
#define DFSDM_FLT1FCR_FORD          (0x7U<<29U)
#define DFSDM_FLT1FCR_FORD_0        (0x1U<<29U)

// FLT1JDATAR Configuration

#define DFSDM_FLT1JDATAR_JDATACH    (0x7U<<0U)
#define DFSDM_FLT1JDATAR_JDATACH_0  (0x1U<<0U)
#define DFSDM_FLT1JDATAR_JDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT1JDATAR_JDATA_0    (0x1U<<8U)

// FLT1RDATAR Configuration

#define DFSDM_FLT1RDATAR_RDATACH    (0x7U<<0U)
#define DFSDM_FLT1RDATAR_RDATACH_0  (0x1U<<0U)
#define DFSDM_FLT1RDATAR_RPEND      (0x1U<<4U)
#define DFSDM_FLT1RDATAR_RDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT1RDATAR_RDATA_0    (0x1U<<8U)

// FLT1AWHTR Configuration

#define DFSDM_FLT1AWHTR_BKAWH       (0xFU<<0U)
#define DFSDM_FLT1AWHTR_BKAWH_0     (0x1U<<0U)
#define DFSDM_FLT1AWHTR_AWHT        (0xFFFFFFU<<8U)
#define DFSDM_FLT1AWHTR_AWHT_0      (0x1U<<8U)

// FLT1AWLTR Configuration

#define DFSDM_FLT1AWLTR_BKAWL       (0xFU<<0U)
#define DFSDM_FLT1AWLTR_BKAWL_0     (0x1U<<0U)
#define DFSDM_FLT1AWLTR_AWLT        (0xFFFFFFU<<8U)
#define DFSDM_FLT1AWLTR_AWLT_0      (0x1U<<8U)

// FLT1AWSR Configuration

#define DFSDM_FLT1AWSR_AWLTF        (0xFFU<<0U)
#define DFSDM_FLT1AWSR_AWLTF_0      (0x1U<<0U)
#define DFSDM_FLT1AWSR_AWHTF        (0xFFU<<8U)
#define DFSDM_FLT1AWSR_AWHTF_0      (0x1U<<8U)

// FLT1AWCFR Configuration

#define DFSDM_FLT1AWCFR_CLRAWLTF    (0xFFU<<0U)
#define DFSDM_FLT1AWCFR_CLRAWLTF_0  (0x1U<<0U)
#define DFSDM_FLT1AWCFR_CLRAWHTF    (0xFFU<<8U)
#define DFSDM_FLT1AWCFR_CLRAWHTF_0  (0x1U<<8U)

// FLT1EXMAX Configuration

#define DFSDM_FLT1EXMAX_EXMAXCH     (0x7U<<0U)
#define DFSDM_FLT1EXMAX_EXMAXCH_0   (0x1U<<0U)
#define DFSDM_FLT1EXMAX_EXMAX       (0xFFFFFFU<<8U)
#define DFSDM_FLT1EXMAX_EXMAX_0     (0x1U<<8U)

// FLT1EXMIN Configuration

#define DFSDM_FLT1EXMIN_EXMINCH     (0x7U<<0U)
#define DFSDM_FLT1EXMIN_EXMINCH_0   (0x1U<<0U)
#define DFSDM_FLT1EXMIN_EXMIN       (0xFFFFFFU<<8U)
#define DFSDM_FLT1EXMIN_EXMIN_0     (0x1U<<8U)

// FLT1CNVTIMR Configuration

#define DFSDM_FLT1CNVTIMR_CNVCNT    (0xFFFFFFFU<<4U)
#define DFSDM_FLT1CNVTIMR_CNVCNT_0  (0x1U<<4U)

// FLT2CR1 Configuration

#define DFSDM_FLT2CR1_DFEN          (0x1U<<0U)
#define DFSDM_FLT2CR1_JSWSTART      (0x1U<<1U)
#define DFSDM_FLT2CR1_JSYNC         (0x1U<<3U)
#define DFSDM_FLT2CR1_JSCAN         (0x1U<<4U)
#define DFSDM_FLT2CR1_JDMAEN        (0x1U<<5U)
#define DFSDM_FLT2CR1_JEXTSEL       (0x7U<<8U)
#define DFSDM_FLT2CR1_JEXTSEL_0     (0x1U<<8U)
#define DFSDM_FLT2CR1_JEXTEN        (0x3U<<13U)
#define DFSDM_FLT2CR1_JEXTEN_0      (0x1U<<13U)
#define DFSDM_FLT2CR1_RSWSTART      (0x1U<<17U)
#define DFSDM_FLT2CR1_RCONT         (0x1U<<18U)
#define DFSDM_FLT2CR1_RSYNC         (0x1U<<19U)
#define DFSDM_FLT2CR1_RDMAEN        (0x1U<<21U)
#define DFSDM_FLT2CR1_RCH           (0x7U<<24U)
#define DFSDM_FLT2CR1_RCH_0         (0x1U<<24U)
#define DFSDM_FLT2CR1_FAST          (0x1U<<29U)
#define DFSDM_FLT2CR1_AWFSEL        (0x1U<<30U)

// FLT2CR2 Configuration

#define DFSDM_FLT2CR2_JEOCIE        (0x1U<<0U)
#define DFSDM_FLT2CR2_REOCIE        (0x1U<<1U)
#define DFSDM_FLT2CR2_JOVRIE        (0x1U<<2U)
#define DFSDM_FLT2CR2_ROVRIE        (0x1U<<3U)
#define DFSDM_FLT2CR2_AWDIE         (0x1U<<4U)
#define DFSDM_FLT2CR2_SCDIE         (0x1U<<5U)
#define DFSDM_FLT2CR2_CKABIE        (0x1U<<6U)
#define DFSDM_FLT2CR2_EXCH          (0xFFU<<8U)
#define DFSDM_FLT2CR2_EXCH_0        (0x1U<<8U)
#define DFSDM_FLT2CR2_AWDCH         (0xFFU<<16U)
#define DFSDM_FLT2CR2_AWDCH_0       (0x1U<<16U)

// FLT2ISR Configuration

#define DFSDM_FLT2ISR_JEOCF         (0x1U<<0U)
#define DFSDM_FLT2ISR_REOCF         (0x1U<<1U)
#define DFSDM_FLT2ISR_JOVRF         (0x1U<<2U)
#define DFSDM_FLT2ISR_ROVRF         (0x1U<<3U)
#define DFSDM_FLT2ISR_AWDF          (0x1U<<4U)
#define DFSDM_FLT2ISR_JCIP          (0x1U<<13U)
#define DFSDM_FLT2ISR_RCIP          (0x1U<<14U)
#define DFSDM_FLT2ISR_CKABF         (0xFFU<<16U)
#define DFSDM_FLT2ISR_CKABF_0       (0x1U<<16U)
#define DFSDM_FLT2ISR_SCDF          (0xFFU<<24U)
#define DFSDM_FLT2ISR_SCDF_0        (0x1U<<24U)

// FLT2ICR Configuration

#define DFSDM_FLT2ICR_CLRJOVRF      (0x1U<<2U)
#define DFSDM_FLT2ICR_CLRROVRF      (0x1U<<3U)
#define DFSDM_FLT2ICR_CLRCKABF      (0xFFU<<16U)
#define DFSDM_FLT2ICR_CLRCKABF_0    (0x1U<<16U)
#define DFSDM_FLT2ICR_CLRSCDF       (0xFFU<<24U)
#define DFSDM_FLT2ICR_CLRSCDF_0     (0x1U<<24U)

// FLT2JCHGR Configuration

#define DFSDM_FLT2JCHGR_JCHG        (0xFFU<<0U)
#define DFSDM_FLT2JCHGR_JCHG_0      (0x1U<<0U)

// FLT2FCR Configuration

#define DFSDM_FLT2FCR_IOSR          (0xFFU<<0U)
#define DFSDM_FLT2FCR_IOSR_0        (0x1U<<0U)
#define DFSDM_FLT2FCR_FOSR          (0x3FFU<<16U)
#define DFSDM_FLT2FCR_FOSR_0        (0x1U<<16U)
#define DFSDM_FLT2FCR_FORD          (0x7U<<29U)
#define DFSDM_FLT2FCR_FORD_0        (0x1U<<29U)

// FLT2JDATAR Configuration

#define DFSDM_FLT2JDATAR_JDATACH    (0x7U<<0U)
#define DFSDM_FLT2JDATAR_JDATACH_0  (0x1U<<0U)
#define DFSDM_FLT2JDATAR_JDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT2JDATAR_JDATA_0    (0x1U<<8U)

// FLT2RDATAR Configuration

#define DFSDM_FLT2RDATAR_RDATACH    (0x7U<<0U)
#define DFSDM_FLT2RDATAR_RDATACH_0  (0x1U<<0U)
#define DFSDM_FLT2RDATAR_RPEND      (0x1U<<4U)
#define DFSDM_FLT2RDATAR_RDATA      (0xFFFFFFU<<8U)
#define DFSDM_FLT2RDATAR_RDATA_0    (0x1U<<8U)

// FLT2AWHTR Configuration

#define DFSDM_FLT2AWHTR_BKAWH       (0xFU<<0U)
#define DFSDM_FLT2AWHTR_BKAWH_0     (0x1U<<0U)
#define DFSDM_FLT2AWHTR_AWHT        (0xFFFFFFU<<8U)
#define DFSDM_FLT2AWHTR_AWHT_0      (0x1U<<8U)

// FLT2AWLTR Configuration

#define DFSDM_FLT2AWLTR_BKAWL       (0xFU<<0U)
#define DFSDM_FLT2AWLTR_BKAWL_0     (0x1U<<0U)
#define DFSDM_FLT2AWLTR_AWLT        (0xFFFFFFU<<8U)
#define DFSDM_FLT2AWLTR_AWLT_0      (0x1U<<8U)

// FLT2AWSR Configuration

